<?php
if (! defined ( 'IN_KKFRAME' ))	exit ();
function get_random_content(){
	$text=<<<EOF
喜欢，生活的每一次经历，感动的，悲伤的，等...收集起来，而后点一盏心灯，照亮自己，感恩别人的赠予。
人生，经历越多，心境也会渐渐淡定自然，总感觉，一个人，不管做任何事，只要无愧自己的良心，对待任何人，尽量做到以礼相待；以诚为本；以亲和力相交，以心去换位思考，莫管深浅，定不会辜负当下因缘相遇的风景。
生活没有太多的假设和如果，只需一颗务实的心，脚踏实地，去开创属于自己的前景，不管成就大小，不管行程的艰辛，只要你努力了，成功与否，所有的悲喜交集，也是一种收获。
白落梅说：“一山一水一朝一夕，自己安静地走完。倘若不慎走失迷途，跌入水中也应记得有一条河叫重生”。
青春的步伐，我们慷慨激昂，不服输的个性，若骑士，总想征服下一座城池。当经历，在风云变幻中，一点点细磨后，慢慢领悟，生命的蓝图，不是横冲直撞，更需一颗沉着冷静的心，处理直击风雨。
一颗心，在红尘游走，各种繁嚣来敲门，能够做到几分恪守不浮躁，实践中不易。光阴，总是把好与坏的事物随时安排于左右，于是，情绪这个东西，隐在心底，有时就会像阴雨天气，下个不停...虽是防不胜防，但还是要感谢一些伤害与挫折，历练了你的隐忍，让你学会运筹帷幄，以静观其变。
某时却又充满玄机与生机，让你懂得“锄禾日当午”的艰辛；又让你懂得亲自播种的一些种子，未必都有收获，然而，从中最大的收益不是结果，而是懂得了入世观情，谦卑慎行，用一次低头的韬光养晦，步步迎阵，突破围城，超越自我。
光阴是导师，这一程山，一程水，走过，我倾听讲解，虚心领会，当一路的风景描摹，直到掌心磨砺出了岁月的老茧，一层层垫厚，入眼，感知这一圈一圈的纹路，都是泪与汗水见证下的生命契机，感恩因果皆在于心的导航，一半清醒，一半醉，一切，痛而不言，笑而不语。唯低调的格局，才能彰显生命厚重的沉稳。
每个人的人生，都有各自的故事，各自的不易，各自的点滴，演绎着人生的大舞台。悲欢离合，情节起落，我们无权过问，但自身不能有一丝自满、自傲、且目中无人的心理存在，要知道这人世间，山外有山，天外有天。
琵琶行浔阳江头夜送客，枫叶荻花秋瑟瑟。
主人下马客在船，举酒欲饮无管弦。
醉不成欢惨将别，别时茫茫江浸月。
忽闻水上琵琶声，主人忘归客不发.
寻声暗问弹者谁？琵琶声停欲语迟。
移船相近邀相见，添酒回灯重开宴。
千呼万唤始出来，犹抱琵琶半遮面。
转轴拨弦三两声，未成曲调先有情。
弦弦掩抑声声思，似诉平生不得志。
低眉信手续续弹，说尽心中无限事。
轻拢慢捻抹复挑，初为《霓裳》后《六幺》。
大弦嘈嘈如急雨，小弦切切如私语。
嘈嘈切切错杂弹，大珠小珠落玉盘。
间关莺语花底滑，幽咽泉流冰下难。
冰泉冷涩弦凝绝，凝绝不通声暂歇。
别有幽愁暗恨生，此时无声胜有声。
银瓶乍破水浆迸，铁骑突出刀枪鸣。
曲终收拨当心画，四弦一声如裂帛。
说起喝茶，我最喜欢铁观音，因它的性情如温良的女子，不凉不热，比较温和，所以适合胃凉的我。喝茶，喝的是一种心境，感觉身心被净化。喝茶，又像文人写散文，飘逸脱俗，抒情文采，有感而发。于茶相伴，有着岁月沉淀后的平静与追忆，尝过的世情冷暖，读过的人间沧桑，看过的琳琅风景，都会与我们渐行渐远。所以，我们要珍惜缘分。如品茶一样，不要去选择茶的好坏，相遇即是恩泽，惜缘更是福祉。
品一盏茶，洗去尘埃，洗去世间的虚情假意，然后，在一盏禅茶时间里，获得清欢。我等你，与我共一场禅茶之约。你若来，我定与你听雪品茗，谈世情、聊古今，共度清宁时光。
在一盏茶香里，听窗外的风呼唤着冬的沉重。这纷纷扬扬的时光，是寂寞，是清凉，是暗夜里静开着的兰香。心念，若水涓涓流淌，透着薄凉，也饱蘸着丰盈。我在一片落叶里为你写诗，写风过萧山，写梅开沈园，写雪落江南。伴着月，依着云，循着水，便能找到我们心灵交汇的那片芳草地，那里有着初春刚绽放的花蕊，极致而美丽。
夜未央，给自己泡一杯清茶，放些菊花和枸杞入茶，一杯热茶暖暖的沁入心扉，这样的暖，抵抗夜的寒。木门虚掩，只等你满身雪花归来，与我对坐在一盆红泥炉火旁，品茗听雪，温一壶岁月流逝的记忆。
岁月，悄无声息的让季节转换。雪过天晴，看山川、树、花、还有那些枯黄的野草，被渲染成一幅灵动的画卷。“ 清霜醉枫叶，淡月隐芦苇 ” ，踏雪寻梅后，人生自得一番境界。昨日的经历不经意丰厚了生命的底蕴，疏淡了人世纷纭。让寻常的日子过的平淡有致，试着学会将自己慢下来，留意一些往日忽略过的美。你会发现，明月依旧照晴窗。就让每一个晨曦暮霞从悠静的岁月里从容而过，在简约的日子里静待花开，将平淡的日子过出新意，让一颗安恬的心，漾着浅喜，盈着深爱。
冬天是蕴藏的季节，少了艳丽的色彩，多了厚实与凝重。季节的歌飘远了，梦的枝头，栖息成清浅且幽香的花。终是恋花的女子，喜欢花朵在阳光下尽情地舒展，看她们在风雨中傲然地挺拔。我愿用温情和爱心去接受这个冬天给予我的寒凉和冷寂，生活就是在寒冬里的历练，生活也是用体温滋养的玉石，需要幽香才能萦绕一方梦园。
平淡的人生，温暖而安恬，就像一个人历经了千回百转，之后便是从容不迫，是朴素，是清淡。而生活本就是自然与朴实的结晶。烟火人生，我宁愿守着一隅清宁，在时光深处，简单地生活，写字，听雪，爱一个人。如此而已。
东船西舫悄无言，唯见江心秋月白。
沉吟放拨插弦中，整顿衣裳起敛容。
自言本是京城女，家在虾蟆陵下住。（下马陵）
十三学得琵琶成，名属教坊第一部。
曲罢曾教善才服，妆成每被秋娘妒。
五陵年少争缠头，一曲红绡不知数。
钿头银篦击节碎，血色罗裙翻酒污。
今年欢笑复明年，秋月春风等闲度。
弟走从军阿姨死，暮去朝来颜色故。
门前冷落鞍马稀，老大嫁作商人妇。
商人重利轻别离，前月浮梁买茶去。
去来江口守空船，绕船月明江水寒。
夜深忽梦少年事，梦啼妆泪红阑干。
我闻琵琶已叹息，又闻此语重唧唧。
同是天涯沦落人，相逢何必曾相识！
我从去年辞帝京，谪居卧病浔阳城。
浔阳地僻无音乐，终岁不闻丝竹声。
住近湓江地低湿，黄芦苦竹绕宅生。
其间旦暮闻何物？杜鹃啼血猿哀鸣。
春江花朝秋月夜，往往取酒还独倾。
岂无山歌与村笛，呕哑嘲哳难为听。
今夜闻君琵琶语，如听仙乐耳暂明。
莫辞更坐弹一曲，为君翻作《琵琶行》。
感我此言良久立，却坐促弦弦转急。
凄凄不似向前声，满座重闻皆掩泣。
座中泣下谁最多?江州司马青衫湿。
光阴的路上，碰到形形色色之人，尽量做到心平气和，才能解决当下一件件的事情。一个人的路走多远，爬多高，取决于你的胸怀，胸怀有多大，路自然有多宽！
经历多了，生命的底色才会蕴含厚实。
在纵横交错的时光，起浮过，得失过，才会心怀一份懂得，让我们对岁月充满感激，还有一颗包容之心的可贵。
人生，不管走到哪里，不管处在什么样的位置，都别忘了，你只是这红尘中，一个平凡的过客，所有的繁华、璀璨、辉煌，都会有落幕的一天。无论何时何地，保持谦逊平和之心处世，才是智者。
际遇，有时不容我们多想，有时别无选择，有时更不容我们太贪心，我们在做到且行且珍惜时，记得把心分为两间用房，一间容纳生活的琐碎，做到为人处事中的尽心尽责，虽束缚，也要安于自我行为的约束，这样你才能于法则丛林中收获成果，才能于烟火味中生存；一间给灵魂栖居，给灵魂自由流浪。生活的现实压力，需要我们时刻调整自己，需要时不时的放空自己，需要一个空旷的空间储藏正能量，这一间，可储藏梦想，可储藏所爱之人，可储藏兴趣等、、、所有的，只为调整身心的快乐！
人生的种种际遇，若酒，若茶，种种味道，有时不可言说，也不要逢人就诉说，我们惟有安顿好这两间用房，生命的步子，才会越走越踏实，越走越充实！
岁月，一步一个踏实的脚印，行之，意无狂；处世，行无躁；交友，思无邪；平和人生的大智若愚，大道至简！
EOF;
	$contents=explode("\n", $text);
	$content=$contents[array_rand($contents)];
	return $content;
}
function get_random_tid($tieba){
	$ch = curl_init ('http://tieba.baidu.com/f?kw='.urlencode(iconv('utf-8', 'utf-8', $tieba)).'&fr=index');
	curl_setopt ( $ch, CURLOPT_RETURNTRANSFER, 1 );
	$contents = curl_exec ( $ch );
	curl_close ( $ch );
	preg_match_all('/<li class="j_thread_list[A-z0-9 -_]+" data-field=\'{(?<json>.*?)}\'/', $contents, $jsontids);
	foreach ($jsontids['json'] as $jsontid){
		$jsontid=str_replace('&quot;','"', '{'.$jsontid.'}');
		$tids[]=json_decode($jsontid)->id;
	}
	$tid=$tids[rand(0,count($tids)-1)];
	return $tid;
}
function client_rppost($uid, $tieba, $content) {
	$cookie = get_cookie ( $uid );
	preg_match ( '/BDUSS=([^ ;]+);/i', $cookie, $matches );
	$BDUSS = trim ( $matches [1] );
	$setting = DB::fetch_first ( "SELECT * FROM xxx_post_setting WHERE uid='{$uid}'" );
	if ($setting ['client_type'] == 5)
		$setting ['client_type'] = rand ( 1, 4 );
	if (! $BDUSS) return array (- 1,'找不到 BDUSS Cookie' );
	if (! $content) $content=get_random_content();
	if (! $tieba['tid']) $tieba['tid']=get_random_tid($tieba ['name']);
	$formdata = array (
			'BDUSS' => $BDUSS,
			'_client_id' => 'wappc_136' . random ( 10, true ) . '_' . random ( 3, true ),
			'_client_type' => $setting ['client_type'],
			'_client_version' => '5.0.0',
			'_phone_imei' => md5 ( random ( 16 ) ),
			'anonymous' => 0,
			'content' => $content,
			'fid' => $tieba ['fid'],
			'kw' => urldecode ( $tieba ['name'] ),
			'net_type' => 3,
			'tbs' => get_tbs ( $tieba ['uid'] ),
			'tid' => $tieba ['tid'],
			'title' => ""
	);
	$adddata = '';
	foreach ( $formdata as $k => $v )
		$adddata .= $k . '=' . $v;
	$sign = strtoupper ( md5 ( $adddata . 'tiebaclient!!!' ) );
	$formdata ['sign'] = $sign;
	$ch = curl_init ( 'http://c.tieba.baidu.com/c/c/post/add' );
	curl_setopt ( $ch, CURLOPT_HTTPHEADER, array (
			'Content-Type: application/x-www-form-urlencoded'
	) );
	curl_setopt ( $ch, CURLOPT_RETURNTRANSFER, true );
	curl_setopt ( $ch, CURLOPT_COOKIE, $cookie );
	curl_setopt ( $ch, CURLOPT_POST, true );
	curl_setopt ( $ch, CURLOPT_POSTFIELDS, http_build_query ( $formdata ) );
	$re = @json_decode ( curl_exec ( $ch ), ture );
	curl_close ( $ch );
	switch ($setting ['client_type']) {
		case '1' :
			$client_res = "iphone";
			break;
		case '2' :
			$client_res = "android";
			break;
		case '3' :
			$client_res = "WindowsPhone";
			break;
		case '4' :
			$client_res = "Windows8";
			break;
	}
	if (!$re) return array (0,'JSON 解析错误' );
	if ($re ['error_code'] == 0) return array (2,"使用" . $client_res . '客户端发帖成功，<a href="http://tieba.baidu.com/p/' . $tieba ['tid'] . '" target="_blank">查看帖子</a>');
	else if ($re ['error_code'] == 5) return array (5,"需要输入验证码，请检查你是否已经关注该贴吧。" 	);
	else if ($re ['error_code'] == 7) return array (7,"您的操作太频繁了！" );
	else if ($re ['error_code'] == 8) return array (8,"您已经被封禁" );
	else return array($re ['error_code'],"未知错误，错误代码：" . $re ['error_code']);
}
?>